In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/18/f0/905058bd437423591491092d7e42244babd0c19861e6b1abdadb199a1321/pandas-1.1.4-cp38-cp38-macosx_10_9_x86_64.whl (10.1MB)
    100% |████████████████████████████████| 10.1MB 1.0MB/s ta 0:00:01
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.1)
Collecting numpy>=1.15.4 (from pandas)
  Downloading https://files.pythonhosted.org/packages/cf/7d/642c5619482d032ac87f07b4944b9305f21bd2f6ee426ebc2e8595fe2f7b/numpy-1.19.3-cp38-cp38-macosx_10_9_x86_64.whl (15.9MB)
    100% |████████████████████████████████| 15.9MB 939kB/s ta 0:00:01
Collecting pytz>=2017.2 (from pandas)
  Using cached https://files.pythonhosted.org/packages/4f/a4/879454d49688e2fad93e59d7d4efda580b783c745fd2ec2a3adf87b0808d/pytz-2020.1-py2.py3-none-any.whl
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: numpy, pytz, pandas
Successfully installed numpy-1.19.3 pandas-1.1.4 pytz-2020.1

In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']

In [4]:
df

    Name Age Height
0  Allen  22    175

In [5]:
df.loc[1] = ['Ted', '25', '180']
df.loc[2] = ['Mike', '28', '170']

In [6]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Mike  28    170

In [7]:
df['Weight'] = ['75', '80', '70']

In [8]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Mike  28    170     70

In [9]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Mike  28    170

In [10]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80
2   Mike  28    170     70

In [11]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Mike  28    170

In [12]:
df.drop(2)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [13]:
df = df.drop(2)

In [14]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [15]:
df['Height'][0]

'175'

In [16]:
df['Height'][0] = '180'
df

    Name Age Height
0  Allen  22    180
1    Ted  25    180

In [17]:
df['Height'] = '222'
df

    Name Age Height
0  Allen  22    222
1    Ted  25    222

In [18]:
df.loc[1] = '111'
df

    Name  Age Height
0  Allen   22    222
1    111  111    111

In [19]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Judy', '30', '177'],
    ['Ted', '33', '188']
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

   Name Age Height
0  Judy  30    177
1   Ted  33    188

In [20]:
df

    Name  Age Height
0  Allen   22    222
1    111  111    111

In [21]:
df.append(df2)

    Name  Age Height
0  Allen   22    222
1    111  111    111
0   Judy   30    177
1    Ted   33    188

In [22]:
df

    Name  Age Height
0  Allen   22    222
1    111  111    111

In [23]:
df = df.append(df2)
df

    Name  Age Height
0  Allen   22    222
1    111  111    111
0   Judy   30    177
1    Ted   33    188

In [24]:
df.reset_index()

   index   Name  Age Height
0      0  Allen   22    222
1      1    111  111    111
2      0   Judy   30    177
3      1    Ted   33    188

In [25]:
df.reset_index(drop=True)

    Name  Age Height
0  Allen   22    222
1    111  111    111
2   Judy   30    177
3    Ted   33    188

In [26]:
df

    Name  Age Height
0  Allen   22    222
1    111  111    111
0   Judy   30    177
1    Ted   33    188

In [27]:
df = df.reset_index(drop=True)
df

    Name  Age Height
0  Allen   22    222
1    111  111    111
2   Judy   30    177
3    Ted   33    188

In [28]:
df3 = df 
df3

    Name  Age Height
0  Allen   22    222
1    111  111    111
2   Judy   30    177
3    Ted   33    188

In [29]:
df

    Name  Age Height
0  Allen   22    222
1    111  111    111
2   Judy   30    177
3    Ted   33    188

In [30]:
df3['Height'] = '111111'

In [31]:
df3

    Name  Age  Height
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111

In [32]:
df

    Name  Age  Height
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111

In [33]:
df4 = df.copy()
df4

    Name  Age  Height
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111

In [34]:
df

    Name  Age  Height
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111

In [35]:
df4['Age'] = '222222222'
df4

    Name        Age  Height
0  Allen  222222222  111111
1    111  222222222  111111
2   Judy  222222222  111111
3    Ted  222222222  111111

In [36]:
df

    Name  Age  Height
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111

In [37]:
df.to_csv('./test.csv')

In [38]:
df.to_csv('./test.csv', index=False)

In [39]:
df.to_csv('./test.csv', index=False, header=None)

In [40]:
dfRead = pd.read_csv('./test.csv')
dfRead

  Allen   22  111111
0   111  111  111111
1  Judy   30  111111
2   Ted   33  111111

In [41]:
dfRead = pd.read_csv('./test.csv', header=None)
dfRead

       0    1       2
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111

In [44]:
dfRead.columns = ['Name', 'Age', 'Height']

In [45]:
dfRead

    Name  Age  Height
0  Allen   22  111111
1    111  111  111111
2   Judy   30  111111
3    Ted   33  111111